#+TITLE: Dirty duck: A triage's guided tour
#+AUTHOR: Center of Data Science for Public Policy
#+EMAIL: adolfo@uchicago.edu
#+STARTUP: showeverything
#+STARTUP: nohideblocks
#+PROPERTY: header-args:sql :engine postgresql
#+PROPERTY: header-args:sql+ :dbhost 0.0.0.0
#+PROPERTY: header-args:sql+ :dbport 5434
#+PROPERTY: header-args:sql+ :dbuser food_user
#+PROPERTY: header-args:sql+ :dbpassword some_password
#+PROPERTY: header-args:sql+ :database food
#+PROPERTY: header-args:sql+ :results table drawer
#+PROPERTY: header-args:shell     :results drawer
#+PROPERTY: header-args:ipython   :session food_inspections


*** Time splitting

    For this section we will need get some info about the time span of our
    data,

    #+BEGIN_SRC sql
      select
      min(date) as modeling_start_time,
      max(date) as modeling_end_time
      from cleaned.inspections;
    #+END_SRC

    #+RESULTS:
    :RESULTS:
    | modeling_start_time | modeling_end_time |
    |-------------------+-----------------|
    |        2010-01-04 |      2017-08-18 |
    :END:



    #+BEGIN_SRC yaml
        temporal_config:
          beginning_of_time: '2010-01-04' # earliest date included in features
          modeling_start_time: '2014-01-01' # earliest date in any model
          modeling_end_time: '2017-01-01' # all dates in any model are < this date

          update_window: '1 y' # how frequently to retrain models

          train_example_frequency: '1 d' # time between rows for same entity in train matrix
          train_durations: ['1 y'] # length of time included in a train matrix
          train_label_windows: ['3 month'] # time period across which outcomes are labeled in train matrices

          test_example_frequency: '1 d' # time between rows for same entity in test matrix
          test_durations: ['1 d'] # length of time included in a test matrix
          test_label_windows: ['3 month'] # time period across which outcomes are labeled in test matrices
    #+END_SRC


    We will refer the reader to the image in section [[Cross temporal validation and Timechop]]

*** Running the experiment

    #+BEGIN_SRC ipython :tangle ./src/run.py
      import os
      import sqlalchemy
      import yaml

      from catwalk.storage import FSModelStorageEngine
      from triage.experiments import SingleThreadedExperiment

      food_db = os.environ.get('FOOD_DB_URL')

      print(food_db)

      with open('inspections-training.yaml') as f:
          experiment_config = yaml.load(f)

      experiment = SingleThreadedExperiment(
          config=experiment_config,
          db_engine=sqlalchemy.create_engine(food_db),
          model_storage_class=FSModelStorageEngine,
          project_path='./triage-generated'
      )

      experiment.run()
    #+END_SRC


    #+BEGIN_SRC sh :dir /docker:root@tutorial_bastion:/code :results org drawer
      python run.py
    #+END_SRC

    #+RESULTS:
    :RESULTS:
    :END:


